gcc -g p6final.c
îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x722: file p6final.c, line 9.
(gdb) r
Starting program: /home/runner/IA1-Revision/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p6final.c:9
9   {
(gdb) n
13    input(a, b);
(gdb) s
input (a=0x7ffef5348450 "\001", b=0x7ffef5348470 "") at p6final.c:22
22      printf("Enter a word: ");
(gdb) n
23      scanf("%s", a);
(gdb) n
Enter a word: hello world
25      printf("Enter a word: ");
(gdb) n
26      scanf("%s", b);
(gdb) n
27  }
(gdb) c
Continuing.
Enter a word: world is greater than hello
[Inferior 1 (process 1038) exited normally